<a href="https://colab.research.google.com/github/aguinaldoabbj/minicourse_open_data_natal_2019/blob/master/1_intro_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas basics



## Introduction

Pandas is a library that unifies the most common workflows that data analysts and data scientists previously relied on many different libraries for. Pandas has quickly became an important tool in a data professional's toolbelt and is the most popular library for working with tabular data in Python. Tabular data is any data that can be represented as rows and columns. 

To represent tabular data, Pandas uses a custom data structure called a **DataFrame**. A DataFrame is a highly efficient, 2-dimensional data structure that provides a suite of methods and attributes to quickly explore, analyze, and visualize data. The DataFrame is similar to the NumPy 2D array but adds support for many features that help you work with tabular data.

One of the biggest advantages that Pandas has over NumPy is the **ability to store mixed data types** in rows and columns. Many tabular datasets contain a range of data types and Pandas DataFrames handle mixed data types effortlessly while NumPy doesn't. Pandas DataFrames **can also handle missing values gracefully** using a custom object, **NaN**, to represent those values. A common complaint with NumPy is its lack of an object to represent missing values and people end up having to find and replace these values manually. In addition, pandas DataFrames contain axis labels for both rows and columns and enable you to refer to elements in the dataframe more intuitively. Since many tabular datasets contain column titles, this means that dataframes preserve the metadata from the file around the data.

To get things started, we have to load Pandas library:

In [0]:
import pandas as pd

## Our case study

In this part of the course, you'll learn the basics of pandas while exploring several datasets [Dados Abertos Natal](http://dados.natal.br/). Let's start things out by using the "Bilhetagem" dataset , which refers to the bus service billing system in Natal. 

You can dowload it through this URL: [Bilhetagem Analítica 2018](http://dados.natal.br/dataset/4fad551d-4d3b-4597-b8d3-7e887e22332e/resource/ec5b95a3-7b93-4346-98f6-1bd013faa651/download/dados-be-2018-analitico.csv)

## Downloading Data

We can download data directly from  [Dados Abertos Natal](http://dados.natal.br/) to our workspace in Google Colab. We can use 'wget' download utility (available in most systems) to get the job done (the exclamation mark in the beginning sinalyzes Colab to use system's utilities instead of Python interpreter)

In [60]:
!wget -c https://raw.githubusercontent.com/aguinaldoabbj/minicourse_open_data_natal_2019/master/data/dados-be-2018-analitico.csv
#wget -c http://dados.natal.br/dataset/4fad551d-4d3b-4597-b8d3-7e887e22332e/resource/0d4a0f0f-b8a5-46a0-acfe-bb9138c8eb9e/download/dados-be-2019-analitico.csv

--2019-03-19 12:32:45--  https://raw.githubusercontent.com/aguinaldoabbj/minicourse_open_data_natal_2019/master/data/dados-be-2018-analitico.csv
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 151.101.0.133, 151.101.64.133, 151.101.128.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|151.101.0.133|:443... connected.
HTTP request sent, awaiting response... 416 Range Not Satisfiable

    The file is already fully retrieved; nothing to do.

We can check if file was downloaded using 'ls':

In [61]:
!ls -lah  dados-be*

-rw-r--r-- 1 root root 72K Mar 19 11:34 dados-be-2018-analitico.csv

# First steps with pandas

## Loading data from a CSV file
As we can see, downloaded data is a CSV file. CSVs are commonly used to store tabular data. In simple words, it contains table rows whose cells are separated by some token, like a comma or semicolon. Pandas provides the read_csv() function, which takes the path of the CSV file and produces a DataFrame representation of its data.

In [0]:
# CSV file uses ';' as separator and is encodded in iso-8859-1
df = pd.read_csv("dados-be-2018-analitico.csv", encoding='iso-8859-1', sep=';')

We can check if data was loaded successfully by calling Dataframe's head( ) method and see the first 5 rows:

In [63]:
df.head(5)

,Mês,Empresa,Linha,Estudante_Cartao,Estudante_BT,Vale_Transporte,Integracao_Plena,Integracao_Complementar,Gratuito_Cartao,Gratuito_BT,Inteira_Cartao,Inteira_Especie,Tarifa_Social,Qtd_Viagens
0,1,CONCEIÇÃO,21,13.493,9.506,35.944,8.671,0.0,17.138,7.397,6.542,43.727,3.965,3.684
1,1,CONCEIÇÃO,22,4.644,3.371,13.088,3.230,0.0,8.109,3.157,2.529,15.363,0.000,1.737
2,1,CONCEIÇÃO,30,8.519,5.614,20.580,5.346,0.0,7.265,3.191,4.415,21.507,1.537,2.500
3,1,CONCEIÇÃO,31,9.631,6.020,23.460,7.587,0.0,7.065,2.922,5.491,22.212,140.000,2.478
4,1,CONCEIÇÃO,41,6.556,4.038,20.388,7.924,0.0,5.704,2.791,3.883,13.870,0.000,2.296

### Exploring the dataframe

Now that we've read the dataset into a DataFrame, we can start using more Pandas DataFrame methods to explore the data. In the same way we have just used the head() to see the firts rows of the DataFrame, we can use the tail( ) method to see the last ones:

In [64]:
df.tail()

,Mês,Empresa,Linha,Estudante_Cartao,Estudante_BT,Vale_Transporte,Integracao_Plena,Integracao_Complementar,Gratuito_Cartao,Gratuito_BT,Inteira_Cartao,Inteira_Especie,Tarifa_Social,Qtd_Viagens
944,10,SANTA MARIA - URB,561,61.0,27.0,2029.0,536.0,0.0,131.0,7.0,219.0,695.0,120.0,340.0
945,10,VIA SUL - URB,50,48362.0,10350.0,71459.0,22085.0,215.0,18052.0,9226.0,14547.0,58611.0,8484.0,5172.0
946,10,VIA SUL - URB,51,30382.0,6422.0,25362.0,9241.0,0.0,10020.0,7065.0,6933.0,29185.0,2293.0,3265.0
947,10,VIA SUL - URB,52,21965.0,5475.0,23329.0,7763.0,0.0,10908.0,7764.0,6190.0,27879.0,2089.0,3120.0
948,10,VIA SUL - URB,65,14231.0,3355.0,14359.0,4247.0,0.0,4541.0,2308.0,3658.0,13157.0,0.0,1739.0

**Tip:** It's always good to use *head()* or *tail()* functions to limit dataset outputs.

A new Dataframe containing 10 random samples of the original Dataframe can be created by using the sample( ) method:

In [65]:
df.sample(10)

,Mês,Empresa,Linha,Estudante_Cartao,Estudante_BT,Vale_Transporte,Integracao_Plena,Integracao_Complementar,Gratuito_Cartao,Gratuito_BT,Inteira_Cartao,Inteira_Especie,Tarifa_Social,Qtd_Viagens
910,10,GUANABARA - URB,2369,1425.000,336.000,2060.000,762.000,0.0,1098.000,498.000,458.000,1635.000,0.000,359.000
386,5,CONCEIÇÃO,63,50.367,17.417,48.877,24.399,1.0,17.892,7.095,8.397,45.478,3.219,4.178
70,1,REUNIDAS,68,8.916,4.619,25.973,5.597,143.0,8.513,3.047,6.133,25.248,1.927,2.379
305,4,DUNAS - URB,33,56.526,28.396,72.578,20.750,0.0,19.562,6.566,16.377,68.632,3.156,4.693
289,4,CONCEIÇÃO,31,23.249,9.581,23.615,9.704,0.0,7.680,3.207,5.971,22.179,0.000,2.461
36,1,GUANABARA - URB,19,4.205,3.362,13.615,4.285,4.0,9.673,4.568,3.369,16.279,913.000,1.923
674,8,CONCEIÇÃO,599,13057.000,3239.000,16496.000,6693.000,71.0,5993.000,975.000,4143.000,11800.000,0.000,1543.000
44,1,GUANABARA - URB,75,8.457,4.805,19.393,3.743,122.0,6.595,2.457,5.100,21.752,1.542,2.125
881,10,GUANABARA - URB,4,15805.000,3876.000,32995.000,7139.000,1.0,4597.000,2929.000,4189.000,21552.000,4253.000,2258.000
715,8,GUANABARA - URB,1301,5604.000,1242.000,5068.000,1204.000,39.0,2097.000,945.000,1561.000,5689.000,0.000,916.000

By these Dataframe printouts, it is possible to overview data structure (rows, columns and cells). A better understanding of the study Dataframe can be obtained with a series of Pandas Dataframe methods:

In [66]:
#get the shape of the df
df.shape

(949, 14)

In [67]:
# show the basic information about the dataset (columns, sizes, column types, etc)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 949 entries, 0 to 948
Data columns (total 14 columns):
Mês                        949 non-null int64
Empresa                    949 non-null object
Linha                      949 non-null int64
Estudante_Cartao           949 non-null float64
Estudante_BT               949 non-null float64
Vale_Transporte            949 non-null float64
Integracao_Plena           949 non-null float64
Integracao_Complementar    949 non-null float64
Gratuito_Cartao            949 non-null float64
Gratuito_BT                949 non-null float64
Inteira_Cartao             949 non-null float64
Inteira_Especie            949 non-null float64
Tarifa_Social              949 non-null float64
Qtd_Viagens                949 non-null float64
dtypes: float64(11), int64(2), object(1)
memory usage: 103.9+ KB

In [68]:
# describe statistical information about the numerical columns
df.describe()

,Mês,Linha,Estudante_Cartao,Estudante_BT,Vale_Transporte,Integracao_Plena,Integracao_Complementar,Gratuito_Cartao,Gratuito_BT,Inteira_Cartao,Inteira_Especie,Tarifa_Social,Qtd_Viagens
count,949.000000,949.000000,949.000000,949.000000,949.000000,949.000000,949.000000,949.000000,949.000000,949.000000,949.000000,949.000000,949.000000
mean,5.492097,1109.404636,7410.613845,2328.857335,10773.196672,3142.489758,70.314604,3736.196684,1852.104958,2381.738394,10533.645599,489.891953,1034.513133
std,2.884410,2239.082157,11892.630953,4004.715689,17442.582959,5382.396103,155.008061,5853.841755,2824.474806,3602.624978,16393.121063,1446.414320,1303.173175
min,1.000000,2.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000
25%,3.000000,39.000000,11.796000,6.554000,19.368000,6.418000,0.000000,8.371000,4.458000,5.582000,19.119000,0.000000,2.918000
50%,5.000000,75.000000,162.000000,158.000000,313.000000,364.000000,0.000000,270.000000,381.000000,319.000000,271.000000,1.305000,434.000000
75%,8.000000,599.000000,10670.000000,3239.000000,15774.000000,4184.000000,65.000000,6141.000000,2991.000000,3746.000000,17110.000000,381.000000,1829.000000
max,10.000000,9018.000000,64442.000000,29076.000000,112950.000000,35284.000000,1309.000000,37702.000000,17586.000000,18331.000000,88285.000000,17298.000000,5407.000000

# Basic concepts and operations in pandas

## Indexing

When you read in a file into a DataFrame, pandas uses the values in the first row (also known as the header) for the column labels and the row number for the row labels. Collectively, the labels are referred to as the index. DataFrames contain both a row index and a column index. Here's a diagram that displays some of the column and row labels for data:

![Pandas Datafrane](https://raw.githubusercontent.com/ivanovitchm/cba2018/master/1-intro-pandas/indexing.png)

The labels allow us to refer to values in the DataFrame, which we'll learn more about in the rest of this notebook.

## Data types

When you displayed individual rows, represented as Series objects, you may have noticed the text "dtype: object" after the last value. "dtype: object" refers to the data type, or dtype, of that Series. The object dtype is equivalent to the string type in Python. Pandas borrows from the NumPy type system and contains the following dtypes:

* "object" - for representing string values.
* "int" - for representing integer values.
* "float" - for representing float values.
* "datatime" - for representing time values.
* "bool" - for representing Boolean values.

When reading a file into a DataFrame, pandas analyzes the values and infers each column's types. To access the types - for each column, use the DataFrame.dtypes attribute to return a Series containing each column name and its corresponding type. It is also possible to specify column's types at the moment of reading data into Pandas by using the dtype attribute in read_csv(). Read more about data types on the [Pandas documentation](https://pandas.pydata.org/pandas-docs/stable/).

Sometimes we can encounter the value - "NaN" - for representing Not a Number, in other words is value that pandas dosen't know how to represent, normally it's associated with missing values.

In [69]:
df.dtypes

Mês                          int64
Empresa                     object
Linha                        int64
Estudante_Cartao           float64
Estudante_BT               float64
Vale_Transporte            float64
Integracao_Plena           float64
Integracao_Complementar    float64
Gratuito_Cartao            float64
Gratuito_BT                float64
Inteira_Cartao             float64
Inteira_Especie            float64
Tarifa_Social              float64
Qtd_Viagens                float64
dtype: object

## Series
The Series object is a core data structure that Pandas uses to represent rows and columns. A Series is a labelled collection of values similar to the NumPy vector. The main advantage of Series objects is the ability to utilize non-integer labels. NumPy arrays can only utilize integer labels for indexing.
Pandas utilizes this feature to provide more context when returning a row or a column from a DataFrame. For example, when you select a row from a DataFrame, instead of just returning the values in that row as a list, pandas returns a Series object that contains the column labels as well as the corresponding values:
The Series object representing the first row looks like:

## Selecting a row
While we use bracket notation to access elements in a NumPy array or a standard list, we need to use the Pandas method loc[] to select rows in a DataFrame. The loc[] method allows you to select rows by row labels. Recall that when you read a file into a dataframe, pandas uses the row number (or position) as each row's label. Pandas uses zero-indexing, so the first row is at index 0, the second row at index 1, and so on.
If you're interested in accessing a single row, pass in the row label to the loc[] method. Also, Python will return an error if you don't pass in a valid row label. For example, the following line takes the seventh row:

In [70]:
# Series object representing the seventh row.
df.loc[6]

Mês                                1
Empresa                    CONCEIÇÃO
Linha                             63
Estudante_Cartao              21.918
Estudante_BT                  14.054
Vale_Transporte               44.118
Integracao_Plena               14.63
Integracao_Complementar            0
Gratuito_Cartao               15.034
Gratuito_BT                    5.771
Inteira_Cartao                 7.765
Inteira_Especie               39.855
Tarifa_Social                  3.182
Qtd_Viagens                    3.768
Name: 6, dtype: object

## Selecting Multiple Rows

If you're interested in accessing multiple rows of the DataFrame, you can pass in either a slice of row labels or a list of row labels, and pandas will return a DataFrame. Note that unlike slicing lists in Python, a slice of a DataFrame using .loc[] will include both the start and the end row:

In [71]:
# DataFrame containing the rows at index 3, 4, 5, and 6 returned.
df.loc[3:6]

,Mês,Empresa,Linha,Estudante_Cartao,Estudante_BT,Vale_Transporte,Integracao_Plena,Integracao_Complementar,Gratuito_Cartao,Gratuito_BT,Inteira_Cartao,Inteira_Especie,Tarifa_Social,Qtd_Viagens
3,1,CONCEIÇÃO,31,9.631,6.020,23.460,7.587,0.0,7.065,2.922,5.491,22.212,140.000,2.478
4,1,CONCEIÇÃO,41,6.556,4.038,20.388,7.924,0.0,5.704,2.791,3.883,13.870,0.000,2.296
5,1,CONCEIÇÃO,59,8.184,6.086,22.623,7.332,0.0,13.514,4.373,4.622,29.075,4.573,2.650
6,1,CONCEIÇÃO,63,21.918,14.054,44.118,14.630,0.0,15.034,5.771,7.765,39.855,3.182,3.768

In [72]:
# DataFrame containing the rows at index 2, 5, and 10 returned
df.loc[[2,5,10]]

,Mês,Empresa,Linha,Estudante_Cartao,Estudante_BT,Vale_Transporte,Integracao_Plena,Integracao_Complementar,Gratuito_Cartao,Gratuito_BT,Inteira_Cartao,Inteira_Especie,Tarifa_Social,Qtd_Viagens
2,1,CONCEIÇÃO,30,8.519,5.614,20.580,5.346,0.0,7.265,3.191,4.415,21.507,1.537,2.500
5,1,CONCEIÇÃO,59,8.184,6.086,22.623,7.332,0.0,13.514,4.373,4.622,29.075,4.573,2.650
10,1,CONCEIÇÃO,411,5.208,2.869,10.397,4.330,0.0,4.723,1.654,2.676,11.043,580.000,1.095

### Exercise

![alt text](https://cdn.dribbble.com/users/2344801/screenshots/4774578/alphatestersanimation2.gif =150x120)

Select the last 10 rows of our dataframe and assign to the variable last_rows. #tip: use .iloc[] method.

In [0]:
# put your code in this cell

## Selecting Individual Columns

When accessing a column in a DataFrame, Pandas returns a Series object containing the row label and each row's value for that column. To access a single column, use bracket notation and pass in the column name as a string:

In [74]:
df['Empresa'].head()

0    CONCEIÇÃO
1    CONCEIÇÃO
2    CONCEIÇÃO
3    CONCEIÇÃO
4    CONCEIÇÃO
Name: Empresa, dtype: object

### Exercise

![alt text](https://cdn.dribbble.com/users/2344801/screenshots/4774578/alphatestersanimation2.gif =150x120)



1.   Assign the "Empresa" column to the variable empresas
2.   Assign the last 5 rows of "Linha" column to the variable linhas. #tip: use the tail() function.

In [0]:
# put your code in this cell

## Selecting Multiple Columns By Name

To select multiple columns, pass in a list of strings representing the column names and pandas will return a dataframe containing only the values in those columns. The following code returns a dataframe containing the "Empresa" and "Linha" columns, in that order:

In [76]:
df[['Empresa','Linha']].head()

     Empresa  Linha
0  CONCEIÇÃO     21
1  CONCEIÇÃO     22
2  CONCEIÇÃO     30
3  CONCEIÇÃO     31
4  CONCEIÇÃO     41

When selecting multiple columns, the order of the columns in the returned DataFrame matches the order of the column names in the list of strings that you passed in. This allows you to easily explore specific columns that may not be positioned next to each other in the DataFrame.

### Exercise

![alt text](https://cdn.dribbble.com/users/2344801/screenshots/4774578/alphatestersanimation2.gif =150x120)

Select and display at least a random sample row of a DataFrame created with only "Empresa", "Linha" and "Mês" columns. Tip: use the sample() or any() functions.

In [0]:
# put your code in this cell

## Column Uniqueness

When in the process of knowing the data, it's interesting to know the uniqueness of some attibutes. For this, Pandas implements the function unique() which can be use, for example, to know how many different bus companies appear in our data:

In [0]:
# uniqueness of column "Empresa"
empresas = df['Empresa'].unique()

In [79]:
# length of the array returned
len(empresas)

6

So, there are 6 different bus companies in our DataFrame.

### Exercise

![alt text](https://cdn.dribbble.com/users/2344801/screenshots/4774578/alphatestersanimation2.gif =150x120)

How many different bus lines are there in our DataFrame?

In [0]:
# put your code in this cell

## Data manipulation with Pandas

### Overview
In the previous sections, we learned how to explore a pandas DataFrame. In this mission, we'll explore how to manipulate a DataFrame and make transformations to it. We'll continue to work with the same data set from the Power Plants information. We'll build a better dataset cleaning the data and removing not useful information. We also gonna learn how to group up informatio and manipulate data.

## Dropping Columns
Sometimes datasets have more information than needed or bad quality data that may be discarded. Let's suppose we don't have to look at half-price entries for students (columns with *Estudante_* as prefix) and, to simplify things outs, let's drop them out of the dataset with the *drop()* function:

**Tip:** a list of dataset columns can be obtained by calling *df.columns*

In [81]:
df.drop(['Estudante_Cartao','Estudante_BT'], axis=1).head() # note that axis=1 means along with "columns". It's a column-wise operation.

,Mês,Empresa,Linha,Vale_Transporte,Integracao_Plena,Integracao_Complementar,Gratuito_Cartao,Gratuito_BT,Inteira_Cartao,Inteira_Especie,Tarifa_Social,Qtd_Viagens
0,1,CONCEIÇÃO,21,35.944,8.671,0.0,17.138,7.397,6.542,43.727,3.965,3.684
1,1,CONCEIÇÃO,22,13.088,3.230,0.0,8.109,3.157,2.529,15.363,0.000,1.737
2,1,CONCEIÇÃO,30,20.580,5.346,0.0,7.265,3.191,4.415,21.507,1.537,2.500
3,1,CONCEIÇÃO,31,23.460,7.587,0.0,7.065,2.922,5.491,22.212,140.000,2.478
4,1,CONCEIÇÃO,41,20.388,7.924,0.0,5.704,2.791,3.883,13.870,0.000,2.296

The same way we dropped some columns, we could think of keeping only certain columns in the dataset. Supposing we want to use only columns "Mês", "Empresa" and "Qtd_Viagens", we can use the *difference()* function to help us out on this:

In [82]:
df.drop(df.columns.difference(['Mês','Empresa','Qtd_Viagens']), axis=1).head()

   Mês    Empresa  Qtd_Viagens
0    1  CONCEIÇÃO        3.684
1    1  CONCEIÇÃO        1.737
2    1  CONCEIÇÃO        2.500
3    1  CONCEIÇÃO        2.478
4    1  CONCEIÇÃO        2.296

### Exercise

![alt text](https://cdn.dribbble.com/users/2344801/screenshots/4774578/alphatestersanimation2.gif =150x120)

Create a new dataframe containing no data regarding subsidized entrance tickets according to the following recipe:


1.  Check column names using *df.columns.tolist()* and assign the resulting list to the variable **col_names**
2.  Remove undesired column names from variable **col_names** using the *remove()*  function.
3.  Use variable **col_names** to map only the desired columns to a new dataframe.

**Tip:** There is no use for the drop() function in this exercise.

In [0]:
# put your code in this cell

## Adding Columns

If instead of dropping, we want to add a new column to the dataframe? What about adding a new column called 'Integracao_Total', which results from the sum of columns 'Integracao_Plena' and 'Integracao_Complementar' ?

In [84]:
df['Integracao_Total'] = df['Integracao_Plena'] + df['Integracao_Complementar']
df.sample(5)

,Mês,Empresa,Linha,Estudante_Cartao,Estudante_BT,Vale_Transporte,Integracao_Plena,Integracao_Complementar,Gratuito_Cartao,Gratuito_BT,Inteira_Cartao,Inteira_Especie,Tarifa_Social,Qtd_Viagens,Integracao_Total
715,8,GUANABARA - URB,1301,5604.000,1242.000,5068.000,1204.000,39.0,2097.000,945.000,1561.000,5689.000,0.00,916.000,1243.000
591,7,DUNAS - URB,332,2647.000,1013.000,5157.000,1114.000,0.0,1060.000,468.000,1255.000,3393.000,0.00,593.000,1114.000
42,1,GUANABARA - URB,70,10.256,7.138,32.410,4.915,54.0,9.859,6.312,5.148,35.015,2.86,2.896,58.915
723,8,GUANABARA - URB,7502,46.000,8.000,38.000,12.000,0.0,13.000,2.000,9.000,49.000,0.00,3.000,12.000
180,2,SANTA MARIA - URB,48,11.148,7.816,13.451,5.642,0.0,7.046,3.825,3.010,18.688,730.00,1.917,5.642

### Exercise

![alt text](https://cdn.dribbble.com/users/2344801/screenshots/4774578/alphatestersanimation2.gif =150x120)

Create a new column of your own by using any arithmetic operation involving the columns of the dataframe.

In [0]:
# put your code in this cell

## Column-wise Operations

A common step in data analysis is to apply an operation or a function to a specific entire column. A primary operation would be a type change in a column. I do not know if you noticed, the data set deals mainly with quantities but they are expressed as floats instead of as intergers (it's a common issue when importing data from spreedsheets). If not let's see:

In [86]:
df.head()

,Mês,Empresa,Linha,Estudante_Cartao,Estudante_BT,Vale_Transporte,Integracao_Plena,Integracao_Complementar,Gratuito_Cartao,Gratuito_BT,Inteira_Cartao,Inteira_Especie,Tarifa_Social,Qtd_Viagens,Integracao_Total
0,1,CONCEIÇÃO,21,13.493,9.506,35.944,8.671,0.0,17.138,7.397,6.542,43.727,3.965,3.684,8.671
1,1,CONCEIÇÃO,22,4.644,3.371,13.088,3.230,0.0,8.109,3.157,2.529,15.363,0.000,1.737,3.230
2,1,CONCEIÇÃO,30,8.519,5.614,20.580,5.346,0.0,7.265,3.191,4.415,21.507,1.537,2.500,5.346
3,1,CONCEIÇÃO,31,9.631,6.020,23.460,7.587,0.0,7.065,2.922,5.491,22.212,140.000,2.478,7.587
4,1,CONCEIÇÃO,41,6.556,4.038,20.388,7.924,0.0,5.704,2.791,3.883,13.870,0.000,2.296,7.924

In [87]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 949 entries, 0 to 948
Data columns (total 15 columns):
Mês                        949 non-null int64
Empresa                    949 non-null object
Linha                      949 non-null int64
Estudante_Cartao           949 non-null float64
Estudante_BT               949 non-null float64
Vale_Transporte            949 non-null float64
Integracao_Plena           949 non-null float64
Integracao_Complementar    949 non-null float64
Gratuito_Cartao            949 non-null float64
Gratuito_BT                949 non-null float64
Inteira_Cartao             949 non-null float64
Inteira_Especie            949 non-null float64
Tarifa_Social              949 non-null float64
Qtd_Viagens                949 non-null float64
Integracao_Total           949 non-null float64
dtypes: float64(12), int64(2), object(1)
memory usage: 111.3+ KB

So, a primary column operation would be to convert these float columns to the right type. As we can see, the floats with 3 decimal places are in fact intergers 1000 times bigger. So lets adjust values in all these columns by mutiplying by 1000.

In [88]:
# multiplying by 1000 all columns but 'Mês','Empresa','Linha'
df[df.columns.difference(['Mês','Empresa','Linha'])] = df[df.columns.difference(['Mês','Empresa','Linha'])] * 1000
df.head()

,Mês,Empresa,Linha,Estudante_Cartao,Estudante_BT,Vale_Transporte,Integracao_Plena,Integracao_Complementar,Gratuito_Cartao,Gratuito_BT,Inteira_Cartao,Inteira_Especie,Tarifa_Social,Qtd_Viagens,Integracao_Total
0,1,CONCEIÇÃO,21,13493.0,9506.0,35944.0,8671.0,0.0,17138.0,7397.0,6542.0,43727.0,3965.0,3684.0,8671.0
1,1,CONCEIÇÃO,22,4644.0,3371.0,13088.0,3230.0,0.0,8109.0,3157.0,2529.0,15363.0,0.0,1737.0,3230.0
2,1,CONCEIÇÃO,30,8519.0,5614.0,20580.0,5346.0,0.0,7265.0,3191.0,4415.0,21507.0,1537.0,2500.0,5346.0
3,1,CONCEIÇÃO,31,9631.0,6020.0,23460.0,7587.0,0.0,7065.0,2922.0,5491.0,22212.0,140000.0,2478.0,7587.0
4,1,CONCEIÇÃO,41,6556.0,4038.0,20388.0,7924.0,0.0,5704.0,2791.0,3883.0,13870.0,0.0,2296.0,7924.0

Now values are adusted, let's convert columns to a more appropriate type (interger) using the *astype()* function.

In [89]:
df[df.columns.difference(['Mês','Empresa','Linha'])] = df[df.columns.difference(['Mês','Empresa','Linha'])].astype('int32')
df.head()

,Mês,Empresa,Linha,Estudante_Cartao,Estudante_BT,Vale_Transporte,Integracao_Plena,Integracao_Complementar,Gratuito_Cartao,Gratuito_BT,Inteira_Cartao,Inteira_Especie,Tarifa_Social,Qtd_Viagens,Integracao_Total
0,1,CONCEIÇÃO,21,13493,9506,35944,8671,0,17137,7397,6542,43727,3965,3683,8671
1,1,CONCEIÇÃO,22,4644,3371,13088,3230,0,8109,3157,2529,15363,0,1736,3230
2,1,CONCEIÇÃO,30,8519,5614,20580,5346,0,7265,3191,4415,21506,1537,2500,5346
3,1,CONCEIÇÃO,31,9631,6020,23460,7587,0,7065,2921,5491,22212,140000,2478,7587
4,1,CONCEIÇÃO,41,6556,4038,20387,7923,0,5704,2791,3883,13870,0,2296,7923

In [90]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 949 entries, 0 to 948
Data columns (total 15 columns):
Mês                        949 non-null int64
Empresa                    949 non-null object
Linha                      949 non-null int64
Estudante_Cartao           949 non-null int32
Estudante_BT               949 non-null int32
Vale_Transporte            949 non-null int32
Integracao_Plena           949 non-null int32
Integracao_Complementar    949 non-null int32
Gratuito_Cartao            949 non-null int32
Gratuito_BT                949 non-null int32
Inteira_Cartao             949 non-null int32
Inteira_Especie            949 non-null int32
Tarifa_Social              949 non-null int32
Qtd_Viagens                949 non-null int32
Integracao_Total           949 non-null int32
dtypes: int32(12), int64(2), object(1)
memory usage: 66.8+ KB

### Exercise

![alt text](https://cdn.dribbble.com/users/2344801/screenshots/4774578/alphatestersanimation2.gif =150x120)

Column "Linha" refers to the name of the bus line. Don't you think it is plausible to convert the type of this column to string (str)? You can use the same mechanims from the previous step to accomplish it.

In [0]:
# put your code in this cell

### The Apply Method

Sometimes it is needed to apply a more complex operation to one or more columns of the data set. To accomplish this more easily, pandas offers the *apply* method, which is able to apply a custom column-wise operation.

Column 'Mês' in the dataframe refers to month numbers. It is also interesting to have a column with the corresponding month names, don't you think? We can do it with the *apply* method, a [lambda function](https://www.w3schools.com/python/python_lambda.asp) and a helper library called **calendar** (to map month numbers into month names). The resulting list of month names could be added as a new column for the dataframe.

In [0]:
#lets import calendar
from calendar import month_name #we want only month_name from calendar.

Calendar's month_name is just an array with months names ordered by number. To get the names, we can just access an element by its index number. For example, if we access the 3rd element in the array, we get 'March'.

In [93]:
month_name[3]

'March'

Thus, we can use apply this mechanism to the whole column "Mês" and obtain as result an array of month names:

In [94]:
month_names = df.Mês.apply(lambda x: month_name[x]) #making the lambda function column wise with apply
month_names.sample(5)

880      October
854    September
495         June
554         June
526         June
Name: Mês, dtype: object

In [95]:
# adding new column called 'Month' with the month names list generated from column 'Mês'
df['Month'] = month_names
df.head()

,Mês,Empresa,Linha,Estudante_Cartao,Estudante_BT,Vale_Transporte,Integracao_Plena,Integracao_Complementar,Gratuito_Cartao,Gratuito_BT,Inteira_Cartao,Inteira_Especie,Tarifa_Social,Qtd_Viagens,Integracao_Total,Month
0,1,CONCEIÇÃO,21,13493,9506,35944,8671,0,17137,7397,6542,43727,3965,3683,8671,January
1,1,CONCEIÇÃO,22,4644,3371,13088,3230,0,8109,3157,2529,15363,0,1736,3230,January
2,1,CONCEIÇÃO,30,8519,5614,20580,5346,0,7265,3191,4415,21506,1537,2500,5346,January
3,1,CONCEIÇÃO,31,9631,6020,23460,7587,0,7065,2921,5491,22212,140000,2478,7587,January
4,1,CONCEIÇÃO,41,6556,4038,20387,7923,0,5704,2791,3883,13870,0,2296,7923,January

### Exercise

![alt text](https://cdn.dribbble.com/users/2344801/screenshots/4774578/alphatestersanimation2.gif =150x120)

Create a new column called "Mdays" containing the number of days for each month of column 'Mês'

**Tip:** Use mdays[ ] from library **calendar.**

In [0]:
# put your code in this cell

## Sorting a dataframe by a column

A sorted dataframe is always better to figure things out. To do so, we need choose a column and to sort the DataFrame by that column. Why don't we build a to 10 rank the whole dataframe in relation to the round trips ("Qtd_Viagens" column)? We can use the method  *sort_values()* to help us out:

In [97]:
df.sort_values("Qtd_Viagens", ascending=False).head(10) # if ascending=False, the rank order will be descending

,Mês,Empresa,Linha,Estudante_Cartao,Estudante_BT,Vale_Transporte,Integracao_Plena,Integracao_Complementar,Gratuito_Cartao,Gratuito_BT,Inteira_Cartao,Inteira_Especie,Tarifa_Social,Qtd_Viagens,Integracao_Total,Month
756,8,VIA SUL - URB,50,50046000,18556000,75385000,24216000,270000,19818000,8773000,16290000,63519000,0,5407000,24486000,August
921,10,REUNIDAS,73,64442000,17125000,112219000,34462000,552000,17811000,10888000,16827000,79980000,17298000,5402000,35014000,October
730,8,REUNIDAS,73,59512000,28088000,112950000,35284000,561000,17999000,10048000,17879000,86623000,0,5224000,35845000,August
634,7,REUNIDAS,73,36317000,23770000,110321000,31765000,551000,17278000,9543000,16770000,82161000,0,5205000,32316000,July
945,10,VIA SUL - URB,50,48362000,10350000,71459000,22085000,215000,18052000,9226000,14547000,58611000,8484000,5172000,22300000,October
827,9,REUNIDAS,73,64051000,14496000,106976000,33082000,544000,16997000,10421000,16265000,88285000,4926000,5107000,33626000,September
851,9,VIA SUL - URB,50,48262000,8168000,68292000,21787000,195000,17424000,8704000,14353000,61423000,2191000,4955000,21982000,September
540,6,REUNIDAS,73,48333000,29076000,107369000,33289000,530000,16590000,9180000,15834000,78222000,0,4943000,33819000,June
658,7,VIA SUL - URB,50,30033000,15261000,68104000,20281000,181000,16458000,7437000,14009000,56394000,0,4835000,20462000,July
564,6,VIA SUL - URB,50,38482000,18491000,69165000,21382000,193000,16585000,7357000,13900000,55379000,0,4769000,21575000,June

We can also use more columns to sort the dataframe by. Let's now rank dataframe rows by columns regarding half-priced entries for students (coluns with "Estudante_" prefix):

In [98]:
df.sort_values(by=['Estudante_Cartao','Estudante_BT'], ascending=False).head(10) # by statement is needed when using more than one column

,Mês,Empresa,Linha,Estudante_Cartao,Estudante_BT,Vale_Transporte,Integracao_Plena,Integracao_Complementar,Gratuito_Cartao,Gratuito_BT,Inteira_Cartao,Inteira_Especie,Tarifa_Social,Qtd_Viagens,Integracao_Total,Month
921,10,REUNIDAS,73,64442000,17125000,112219000,34462000,552000,17811000,10888000,16827000,79980000,17298000,5402000,35014000,October
827,9,REUNIDAS,73,64051000,14496000,106976000,33082000,544000,16997000,10421000,16265000,88285000,4926000,5107000,33626000,September
681,8,DUNAS - URB,33,63380000,22643000,76702000,20822000,205000,20232000,7795000,18331000,71492000,0,4575000,21027000,August
874,10,DUNAS - URB,33,62959000,11712000,73935000,20262000,182000,20276000,8003000,16988000,64794000,11973000,4481000,20444000,October
779,9,DUNAS - URB,33,60017000,9664000,67806000,18870000,161000,18092000,7474000,16496000,67102000,2964000,4305000,19031000,September
730,8,REUNIDAS,73,59512000,28088000,112950000,35284000,561000,17999000,10048000,17879000,86623000,0,5224000,35845000,August
668,8,CONCEIÇÃO,63,59056000,17759000,51840000,26449000,0,19201000,7964000,10033000,45732000,0,4303000,26449000,August
861,10,CONCEIÇÃO,63,56286000,9673000,49430000,24821000,0,18210000,7941000,9032000,40540000,8052000,4276000,24821000,October
766,9,CONCEIÇÃO,63,55360000,8462000,46138000,23372000,1000,17327000,7589000,9084000,44929000,1713000,4147000,23373000,September
756,8,VIA SUL - URB,50,50046000,18556000,75385000,24216000,270000,19818000,8773000,16290000,63519000,0,5407000,24486000,August

### Exercise

![alt text](https://cdn.dribbble.com/users/2344801/screenshots/4774578/alphatestersanimation2.gif =150x120)

Build a rank containing **only** the column "Linha" and a target column (chosen by you). You can sort rows in any order.

**Tip:** Use function df.drop() do get rid of undesired columns and then use df.sort_values().

In [0]:
# put your code in this cell

### Grouping information by a column

Sometimes we need to group information, to do so we can use the function *groupby()* to group data and then apply to the result an aggregation function. In this example,  we gonna group all dataframe in relation to the columns "Month" and "Mês" (because they represent the same information). The result will be a montly aggregation of all data.

In [100]:
df.groupby(['Month','Mês'], as_index=False).sum() #as_index=False means that the aggregation column will be not turned into an index

,Month,Mês,Linha,Estudante_Cartao,Estudante_BT,Vale_Transporte,Integracao_Plena,Integracao_Complementar,Gratuito_Cartao,Gratuito_BT,Inteira_Cartao,Inteira_Especie,Tarifa_Social,Qtd_Viagens,Integracao_Total
0,April,4,103495,7.463945e+06,7141778.0,5.541217e+06,6965000.0,6069179.0,7073104.0,11355747.0,7585111.0,4.635556e+06,16013662.0,11783512.0,13034181.0
1,August,8,111409,1.584763e+09,560499000.0,2.164823e+09,640724000.0,8088000.0,755925000.0,364295000.0,488153000.0,2.135562e+09,0.0,195284000.0,648812000.0
2,February,2,103495,3.967060e+06,4929619.0,4.537312e+06,8512366.0,5204000.0,8217979.0,8693966.0,6522158.0,6.462696e+06,20434622.0,12686772.0,13716371.0
3,January,1,119974,6.165940e+06,6472576.0,5.771514e+06,8075591.0,5591000.0,7314803.0,7796217.0,6317885.0,5.319370e+06,14070306.0,11807383.0,13666594.0
4,July,7,103495,1.084662e+09,484700000.0,2.024453e+09,557249000.0,7284000.0,684655000.0,318444000.0,430359000.0,1.961328e+09,0.0,182527000.0,564533000.0
5,June,6,103482,1.218904e+09,542724000.0,1.980585e+09,570681000.0,7436000.0,666944000.0,311043000.0,418158000.0,1.884429e+09,0.0,174948000.0,578117000.0
6,March,3,102193,5.435700e+06,4824876.0,5.917787e+06,4960706.0,5927027.0,5041274.0,9802611.0,5459151.0,4.639746e+06,24213248.0,12149790.0,10887736.0
7,May,5,104095,3.210850e+06,5535718.0,5.303749e+06,5976069.0,6408353.0,4038448.0,9973026.0,6725387.0,4.862259e+06,11636601.0,11065456.0,12384428.0
8,October,10,103495,1.571000e+09,319749000.0,2.066691e+09,601418000.0,7657000.0,720123000.0,366005000.0,449238000.0,1.946104e+09,295491000.0,189004000.0,609075000.0
9,September,9,97692,1.547100e+09,273509000.0,1.960140e+09,577661000.0,7064000.0,686318000.0,350239000.0,441752000.0,2.043087e+09,83048000.0,180497000.0,584725000.0

### Exercise

![alt text](https://cdn.dribbble.com/users/2344801/screenshots/4774578/alphatestersanimation2.gif =150x120)

As you can see, the result dataframe print in the previous example is a bit messy. Column "Linha" are not meant to be aggregated (because it does not make any sense to sum up bus line numbers) and result is not sorted.

So, I gently ask you to build a more presentable result dataframe by dropping the nonsense column and ordering rows by month ('Mês') in ascending order.

In [0]:
# put your code in this cell